const mainContainer = document.getElementsByTagName("main")[0];

const data = [{
        title: "",
        qoute: "إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ ۚ يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا [الأحزاب:56]",
        highlighted: "إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ ۚ يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا [الأحزاب:56]",
        qouteSource: "",
        imgURL: "images/6.jpg",
        imgALT: "إِنَّ اللَّهَ وَمَلَائِكَتَهُ يُصَلُّونَ عَلَى النَّبِيِّ ۚ يَا أَيُّهَا الَّذِينَ آمَنُوا صَلُّوا عَلَيْهِ وَسَلِّمُوا تَسْلِيمًا [الأحزاب:56]",
    },
    {
        title: "الأحاديث الصحيحة في فضل الصلاة على النبي",
        qoute: `عن عبد اللَّه بن عمرو بن العاص، رضي اللَّه عنْهُمَا أنَّهُ سمِع رسُول اللَّه صلى الله عليه وسلم يقول : "من صلى عليَّ صلاَةً، صلَّى اللَّه علَيّهِ بِهَا عشْرًا" (رواهُ مسلم).`,
        highlighted: "من صلى عليَّ صلاَةً، صلَّى اللَّه علَيّهِ بِهَا عشْرًا",
        qouteSource: "",
        imgURL: "",
        imgALT: "",
    },
    {
        title: "",
        qoute: `عن ابن مسعود أنَّ رسُول اللَّهِ صلى الله عليه وسلم قَال : "أَوْلى النَّاسِ بِي يوْمَ الْقِيامةِ أَكْثَرُهُم عَليَّ صَلاَةً" (رواه الترمذي).`,
        highlighted: "أَوْلى النَّاسِ بِي يوْمَ الْقِيامةِ أَكْثَرُهُم عَليَّ صَلاَةً",
        qouteSource: "",
        imgURL: "",
        imgALT: "",
    }, {
        title: "",
        qoute: `إذا سَمِعْتُمُ المُؤَذِّنَ، فَقُولوا مِثْلَ ما يقولُ ثُمَّ صَلُّوا عَلَيَّ، فإنَّه مَن صَلَّى عَلَيَّ صَلاةً صَلَّى اللَّهُ عليه بها عَشْرًا، ثُمَّ سَلُوا اللَّهَ لِيَ الوَسِيلَةَ، فإنَّها مَنْزِلَةٌ في الجَنَّةِ، لا تَنْبَغِي إلَّا لِعَبْدٍ مِن عِبادِ اللهِ، وأَرْجُو أنْ أكُونَ أنا هُوَ، فمَن سَأَلَ لي الوَسِيلَةَ حَلَّتْ له الشَّفاعَةُ. [صحيح مسلم: 384]`,
        highlighted: "فإنَّه مَن صَلَّى عَلَيَّ صَلاةً صَلَّى اللَّهُ عليه بها عَشْرًا",
        qouteSource: "",
        imgURL: "",
        imgALT: "",
    },
    {
        title: "فضل الصلاة على النبي يوم الجمعة",
        qoute: `عن أوس بن أوسٍ، قَالَ: قالَ رسول الله صلى الله عليه وسلم : "إنَّ مِن أَفْضلِ أيَّامِكُمْ يَوْمَ الجُمُعةِ، فَأَكْثِرُوا عليَّ مِنَ الصلاةِ فِيهِ، فإنَّ صَلاتَكُمْ معْرُوضَةٌ علَيَّ فقالوا: يَا رسول اللَّه، وكَيْفَ تُعرضُ صلاتُنَا عليْكَ وقدْ أرَمْتَ (بليت) ؟ قالَ: إنَّ اللَّه حَرم عَلَى الأرْضِ أجْساد الأنْبِياءِ." (رواهُ أَبو داود بإسنادٍ صحيحِ).`,
        highlighted: "إنَّ مِن أَفْضلِ أيَّامِكُمْ يَوْمَ الجُمُعةِ، فَأَكْثِرُوا عليَّ مِنَ الصلاةِ فِيهِ، فإنَّ صَلاتَكُمْ معْرُوضَةٌ علَيَّ فقالوا: يَا رسول اللَّه، وكَيْفَ تُعرضُ صلاتُنَا عليْكَ وقدْ أرَمْتَ (بليت) ؟ قالَ: إنَّ اللَّه حَرم عَلَى الأرْضِ أجْساد الأنْبِياءِ.",
        qouteSource: "",
        imgURL: "",
        imgALT: "",
    },
    {
        title: "صيغ صحيحة في الصلاة على النبي صلى الله عليه وسلم",
        qoute: "",
        highlighted: "",
        qouteSource: "",
        imgURL: "images/3.jpg",
        imgALT: "صيغ صحيحة في الصلاة على النبي صلى الله عليه وسلم",
    },
    {
        title: "",
        qoute: "عن كعب بن عجرة رضي الله تعالى عنه قال : «خرَجَ علينا رسولُ اللهِ صلَّى اللَّهُ علَيهِ وسلَّمَ، فقلنا: قد عَرَفْنَا كيف نُسَلِّمُ عليك، فكيف نُصَلِّي عليك؟ قال: قولوا: اللهمَّ، صلِّ على محمدٍ وعلى آلِ محمدٍ، كما صلَّيْتَ على آلِ إبراهيمَ إنك حميدٌ مجيدٌ، اللهمَّ بارِكْ على محمدٍ وعلى آلِ محمدٍ، كما بارَكْتَ على آلِ إبراهيمَ إنك حميدٌ مجيدٌ» [البخاري:6357] [مسلم:406]",
        highlighted: "اللهمَّ، صلِّ على محمدٍ وعلى آلِ محمدٍ، كما صلَّيْتَ على آلِ إبراهيمَ إنك حميدٌ مجيدٌ، اللهمَّ بارِكْ على محمدٍ وعلى آلِ محمدٍ، كما بارَكْتَ على آلِ إبراهيمَ إنك حميدٌ مجيدٌ",
        qouteSource: "",
        imgURL: "",
        imgALT: "",
    },
    {
        title: "",
        qoute: "عن كعب بن عجرة رضي الله تعالى عنه قال: «سألنا رسولَ اللهِ صلَّى اللهُ عليهِ وسلَّمَ فقلنا: يا رسولَ اللهِ، كيف الصلاةُ عليكم أهلَ البيتِ، فإنَّ اللهَ قد علَّمنا كيف نُسلِّمُ عليكم؟ قال: (قولوا: اللهمَّ صلِّ على محمدٍ وعلى آلِ محمدٍ، كما صلَّيتَ على إبراهيمَ، وعلى آلِ إبراهيمَ، إنكَ حميدٌ مجيدٌ، اللهمَّ بارِكْ على محمدٍ وعلى آلِ محمدٍ، كما باركتَ على إبراهيمَ وعلى آلِ إبراهيمَ، إنكَ حميدٌ مجيدٌ» (البخاري:3370).",
        highlighted: "قولوا: اللهمَّ صلِّ على محمدٍ وعلى آلِ محمدٍ، كما صلَّيتَ على إبراهيمَ، وعلى آلِ إبراهيمَ، إنكَ حميدٌ مجيدٌ، اللهمَّ بارِكْ على محمدٍ وعلى آلِ محمدٍ، كما باركتَ على إبراهيمَ وعلى آلِ إبراهيمَ، إنكَ حميدٌ مجيدٌ",
        qouteSource: "",
        imgURL: "",
        imgALT: "",
    },
    {
        title: "",
        qoute: "عن عقبة بن عمرو بن ثعلبة أبو مسعود رضي الله تعالى عنه قال: «أتانا رسولُ اللَّهِ صلَّى اللَّهُ علَيهِ وسلَّمَ ونحنُ في مَجلسِ سعدِ بنِ عبادةَ فقالَ لَهُ بشيرُ بنُ سعدٍ: أمرَنا اللَّهُ أن نصلِّيَ عليكَ فَكَيفَ نصلِّي عليكَ؟ قالَ: فسَكَتَ رسولُ اللَّهِ صلَّى اللَّهُ علَيهِ وسلَّمَ حتَّى ظننَّا أنَّهُ لم يسألهُ، ثمَّ قالَ رسولُ اللَّهِ صلَّى اللَّهُ علَيهِ وسلَّمَ: قولوا: اللَّهمَّ صلِّ على محمَّدٍ وعلى آلِ محمَّدٍ كما صلَّيتَ علَى إبراهيمَ وعلَى آلِ إبراهيمَ، وبارِكْ على محمَّدٍ وعلى آلِ محمَّدٍ كما بارَكْتَ على إبراهيمَ وعلى آلِ إبراهيمَ في العالَمينَ إنَّكَ حميدٌ مجيدٌ، والسَّلامُ كما قد عُلِّمتُمْ» (الترمذي:3320).",
        highlighted: "اللَّهمَّ صلِّ على محمَّدٍ وعلى آلِ محمَّدٍ كما صلَّيتَ علَى إبراهيمَ وعلَى آلِ إبراهيمَ، وبارِكْ على محمَّدٍ وعلى آلِ محمَّدٍ كما بارَكْتَ على إبراهيمَ وعلى آلِ إبراهيمَ في العالَمينَ إنَّكَ حميدٌ مجيدٌ",
        qouteSource: "",
        imgURL: "",
        imgALT: "",
    },
    {
        title: "",
        qoute: "",
        highlighted: "",
        qouteSource: "",
        imgURL: "",
        imgALT: "",
    },
    {
        title: "",
        qoute: "",
        highlighted: "",
        qouteSource: "",
        imgURL: "",
        imgALT: "",
    },
];


let blockHTML = "";

function addBlock() {
    data.forEach((block) => {
        let finalQoute = block.qoute != "" ? block.qoute.replace(
            block.highlighted,
            `<span class="highlight-qoute">` + block.highlighted + `</span>`
        ) : "";
        blockHTML += `
                <div class="article-block" style="border:none">
                        ${getTitle(block.title)}
                        ${getQuoteOnly(finalQoute, block.qouteSource)}
                        ${getImageOnly(block.imgURL, block.imgALT)}
                </div>
            `;
    });
    mainContainer.innerHTML = blockHTML;
}

function getTitle(title) {
    if (title || title != "") {
        return `<h3 dir="auto">📌 ${title}</h3>`;
    } else {
        return "";
    }
}

function getImageOnly(imgURL, imgALT) {
    if (imgURL === "") {
        return "";
    } else {
        return `<div class="article-img-box"> <img class="article-img" src="${imgURL}" alt="${imgALT}"> </div>`;
    }
}

function getQuoteOnly(qoute, qouteSource) {
    if (qoute == "") return "";
    let s = `
    <div class="qoute-box">
        <p class="qoute">
            ${qoute}
        </p>
    `;
    if (qouteSource != "") {
        s += `<a class="qoute-source" href="${qouteSource}" target="_blank">
                المصدر
            </a>`;
    }
    return s + "</div>";
}

addBlock();